tests/fixtures/artifact-replay/buoyant-success/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0       0       0)
    (0.076   0       0)
    (0.076   2.18    0)
    (0       2.18    0)
    (0       0       0.52)
    (0.076   0       0.52)
    (0.076   2.18    0.52)
    (0       2.18    0.52)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 150 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    cold
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
