tests/fixtures/artifact-replay/buoyant-success/case/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }

    thermodynamics
    {
        Cp              1004.4;
        Hf              0;
    }

    transport
    {
        mu              1.831e-5;
        Pr              0.705;
    }
}
