tests/fixtures/artifact-replay/buoyant-success/case/constant/thermophysicalTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      thermophysicalTransport;
}

simulationType  RAS;

RAS
{
    model           eddyDiffusivity;
    Prt             0.85;
}
