tests/fixtures/artifact-replay/buoyant-success/case/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cold
    {
        type            noSlip;
    }

    hot
    {
        type            noSlip;
    }

    topAndBottom
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            noSlip;
    }
}
