tests/fixtures/artifact-replay/buoyant-success/case/0/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    cold
    {
        type            fixedValue;
        value           uniform 288.15;
    }

    hot
    {
        type            fixedValue;
        value           uniform 307.75;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}
