tests/fixtures/artifact-replay/buoyant-success/case/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-4;

boundaryField
{
    cold
    {
        type            kqRWallFunction;
        value           uniform 3.75e-4;
    }

    hot
    {
        type            kqRWallFunction;
        value           uniform 3.75e-4;
    }

    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-4;
    }

    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 3.75e-4;
    }
}
