tests/fixtures/artifact-replay/buoyant-success/case/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cold
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    hot
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    topAndBottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
