tests/fixtures/artifact-replay/buoyant-success/case/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(h)         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
}

divSchemes
{
    default                                             none;
    div(phi,U)                                          bounded Gauss upwind;
    div(phi,h)                                          bounded Gauss upwind;
    div(phi,K)                                          Gauss linear;
    div(phi,k)                                          bounded Gauss upwind;
    div(phi,omega)                                      bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))                 Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
